Revit 2027 API
ParameterFilterRuleFactory.CreateGreaterOrEqualRule(ElementId, ElementId) Method
 Creates a filter rule that determines whether ElementId values from the document are greater than or equal to a certain value.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FilterRule CreateGreaterOrEqualRule(
	ElementId parameter,
	ElementId value
)
Public Shared Function CreateGreaterOrEqualRule (
	parameter As ElementId,
	value As ElementId
) As FilterRule
public:
static FilterRule^ CreateGreaterOrEqualRule(
	ElementId^ parameter,
	ElementId^ value
)
static member CreateGreaterOrEqualRule :
        parameter : ElementId *
        value : ElementId -> FilterRule
Parameters
parameter ElementId
 An ElementId-typed parameter used to get values from the document for a given element.
value ElementId
 The user-supplied value against which values from the document will be compared.
Return Value
FilterRule
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ParameterFilterRuleFactory Class
CreateGreaterOrEqualRule Overload
Autodesk.Revit.DB Namespace